export const EXPERIENCE_LIST = [
    {
        title: "Frontend / Software Developer",
        company: "Alser.kz",
        description:
            "Разработка и оптимизация основного клиентского сайта. Улучшение производительности и первой загрузки за счёт асинхронной подгрузки данных. " +
            "Разработка мобильного приложения для продавцов, повысившего эффективность работы и качество клиентского сервиса. " +
            "Создание сервиса push-уведомлений для повышения вовлечённости пользователей. " +
            "Разработка административного веб-приложения для брокерской аналитики и приложения для аварийного создания заказов при сбоях сервисов. " +
            "Проведение кроссбраузерного тестирования и улучшение адаптивности.",
        skills: [
            "Vue.js",
            "Nuxt.js",
            "TypeScript",
            "JavaScript (ES6+)",
            "Node.js",
            "NestJS",
            "MongoDB",
            "Ionic",
            "Firebase",
            "HTML5",
            "CSS3 / SCSS",
        ],
    },
    {
        title: "Middle Software Developer",
        company: "Kaspi.kz",
        description:
            "Разработка и поддержка SaaS-продукта для партнёров. Оптимизация модулей для повышения производительности и ускорения бизнес-процессов менеджеров. " +
            "Обновление пользовательских интерфейсов с внедрением современного дизайна и улучшенного UX. " +
            "Участие во внедрении дизайн-системы, разработка и добавление новых компонентов. " +
            "Проведение код-ревью, сопровождение текущих проектов и покрытие ключевых модулей тестами.",
        skills: [
            "Angular",
            "TypeScript",
            "JavaScript",
            "RxJS",
            "REST API",
            "CI/CD",
            "Clean Architecture",
            "Feature-Sliced Design",
            "TDD",
            "Git",
        ],
    },
    {
        title: "Expert developer",
        company: "Halyk bank",
        description:
            "Разработка веб-сайтов и клиентских интерфейсов. Реализация адаптивной и кроссбраузерной вёрстки. " +
            "Работа с дизайнерами и проект-менеджерами, интеграция интерфейсов с backend-сервисами. " +
            "Поддержка и развитие существующих проектов.",
        skills: [
            'Angular',
            'Typescript',
            'JavaScript',
            'Web view',
        ],
    },
];
